Jing-Hua622/stm32f1xx/OLED.C
#include "oled.h"
#include "stdlib.h"
#include "oledfont.h"
#include "stm32f1xx.h"
#include "stm32f1xx_hal.h"
#include "gpio.h"
#include "key.h"
#include "string.h"
#include "internal_flash.h"
//OLED的显存
//存放格式如下.
//[0]0 1 2 3 ... 127	
//[1]0 1 2 3 ... 127	
//[2]0 1 2 3 ... 127	
//[3]0 1 2 3 ... 127	
//[4]0 1 2 3 ... 127	
//[5]0 1 2 3 ... 127	
//[6]0 1 2 3 ... 127	
//[7]0 1 2 3 ... 127 			   
/**********************************************
//IIC Start
**********************************************/
/**********************************************
//IIC Start
**********************************************/

System_Data_typedef System_Data =
{
	.Wait_Time = 5,
	.Realy_Time = 2
};
//Write_Frist_Flag_ADDR
void FlashData_Init(void)
{
	if(ReadFlash(Write_Frist_Flag_ADDR) == 0x01)
	{	
		System_Data.Wait_Time = ReadFlash(WaitTime_ADDR);
		System_Data.Realy_Time = ReadFlash(RealyTime_ADDR);
	}

}

void IIC_Start(void)
{

	OLED_SCLK_Set();
	OLED_SDIN_Set();
	OLED_SDIN_Clr();
	OLED_SCLK_Clr();
}

/**********************************************
//IIC Stop
**********************************************/
void IIC_Stop(void)
{
OLED_SCLK_Set() ;
//	OLED_SCLK_Clr();
	OLED_SDIN_Clr();
	OLED_SDIN_Set();
	
}

void IIC_Wait_Ack(void)
{

	//GPIOB->CRH &= 0XFFF0FFFF;	//设置PB12为上拉输入模式
	//GPIOB->CRH |= 0x00080000;
//	OLED_SDA = 1;
//	delay_us(1);
	//OLED_SCL = 1;
	//delay_us(50000);
/*	while(1)
	{
		if(!OLED_SDA)				//判断是否接收到OLED 应答信号
		{
			//GPIOB->CRH &= 0XFFF0FFFF;	//设置PB12为通用推免输出模式
			//GPIOB->CRH |= 0x00030000;
			return;
		}
	}
*/
	OLED_SCLK_Set() ;
	OLED_SCLK_Clr();
}
/**********************************************
// IIC Write byte
**********************************************/

void Write_IIC_Byte(unsigned char IIC_Byte)
{
	unsigned char i;
	unsigned char m,da;
	da=IIC_Byte;
	OLED_SCLK_Clr();
	for(i=0;i<8;i++)		
	{
			m=da;
		//	OLED_SCLK_Clr();
		m=m&0x80;
		if(m==0x80)
		{OLED_SDIN_Set();}
		else OLED_SDIN_Clr();
			da=da<<1;
		OLED_SCLK_Set();
		OLED_SCLK_Clr();
		}


}
/**********************************************
// IIC Write Command
**********************************************/
void Write_IIC_Command(unsigned char IIC_Command)
{
   IIC_Start();
   Write_IIC_Byte(0x78);            //Slave address,SA0=0
	IIC_Wait_Ack();	
   Write_IIC_Byte(0x00);			//write command
	IIC_Wait_Ack();	
   Write_IIC_Byte(IIC_Command); 
	IIC_Wait_Ack();	
   IIC_Stop();
}
/**********************************************
// IIC Write Data
**********************************************/
void Write_IIC_Data(unsigned char IIC_Data)
{
   IIC_Start();
   Write_IIC_Byte(0x78);			//D/C#=0; R/W#=0
	IIC_Wait_Ack();	
   Write_IIC_Byte(0x40);			//write data
	IIC_Wait_Ack();	
   Write_IIC_Byte(IIC_Data);
	IIC_Wait_Ack();	
   IIC_Stop();
}
void OLED_WR_Byte(unsigned dat,unsigned cmd)
{
	if(cmd)
			{

   Write_IIC_Data(dat);
   
		}
	else {
   Write_IIC_Command(dat);
		
	}


}


/********************************************
// fill_Picture
********************************************/
void fill_picture(unsigned char fill_Data)
{
	unsigned char m,n;
	for(m=0;m<8;m++)
	{
		OLED_WR_Byte(0xb0+m,0);		//page0-page1
		OLED_WR_Byte(0x00,0);		//low column start address
		OLED_WR_Byte(0x10,0);		//high column start address
		for(n=0;n<128;n++)
			{
				OLED_WR_Byte(fill_Data,1);
			}
	}
}


/***********************Delay****************************************/
void Delay_50ms(unsigned int Del_50ms)
{
	unsigned int m;
	for(;Del_50ms>0;Del_50ms--)
		for(m=6245;m>0;m--);
}

void Delay_1ms(unsigned int Del_1ms)
{
	unsigned char j;
	while(Del_1ms--)
	{	
		for(j=0;j<123;j++);
	}
}

//坐标设置

	void OLED_Set_Pos(unsigned char x, unsigned char y) 
{ 	OLED_WR_Byte(0xb0+y,OLED_CMD);
	OLED_WR_Byte(((x&0xf0)>>4)|0x10,OLED_CMD);
	OLED_WR_Byte((x&0x0f),OLED_CMD); 
}   	  
//开启OLED显示    
void OLED_Display_On(void)
{
	OLED_WR_Byte(0X8D,OLED_CMD);  //SET DCDC命令
	OLED_WR_Byte(0X14,OLED_CMD);  //DCDC ON
	OLED_WR_Byte(0XAF,OLED_CMD);  //DISPLAY ON
}
//关闭OLED显示     
void OLED_Display_Off(void)
{
	OLED_WR_Byte(0X8D,OLED_CMD);  //SET DCDC命令
	OLED_WR_Byte(0X10,OLED_CMD);  //DCDC OFF
	OLED_WR_Byte(0XAE,OLED_CMD);  //DISPLAY OFF
}		   			 
//清屏函数,清完屏,整个屏幕是黑色的!和没点亮一样!!!	  
void OLED_Clear(void)  
{  
	u8 i,n;		    
	for(i=0;i<8;i++)  
	{  
		OLED_WR_Byte (0xb0+i,OLED_CMD);    //设置页地址（0~7）
		OLED_WR_Byte (0x00,OLED_CMD);      //设置显示位置—列低地址
		OLED_WR_Byte (0x10,OLED_CMD);      //设置显示位置—列高地址   
		for(n=0;n<128;n++)OLED_WR_Byte(0,OLED_DATA); 
	} //更新显示
}
void OLED_On(void)  
{  
	u8 i,n;		    
	for(i=0;i<8;i++)  
	{  
		OLED_WR_Byte (0xb0+i,OLED_CMD);    //设置页地址（0~7）
		OLED_WR_Byte (0x00,OLED_CMD);      //设置显示位置—列低地址
		OLED_WR_Byte (0x10,OLED_CMD);      //设置显示位置—列高地址   
		for(n=0;n<128;n++)OLED_WR_Byte(1,OLED_DATA); 
	} //更新显示
}
//在指定位置显示一个字符,包括部分字符
//x:0~127
//y:0~63
//mode:0,反白显示;1,正常显示				 
//size:选择字体 16/12 
void OLED_ShowChar(u8 x,u8 y,u8 chr,u8 Char_Size)
{      	
	unsigned char c=0,i=0;	
		c=chr-' ';//得到偏移后的值			
		if(x>Max_Column-1){x=0;y=y+2;}
		if(Char_Size ==16)
			{
			OLED_Set_Pos(x,y);	
			for(i=0;i<8;i++)
			OLED_WR_Byte(F8X16[c*16+i],OLED_DATA);
			OLED_Set_Pos(x,y+1);
			for(i=0;i<8;i++)
			OLED_WR_Byte(F8X16[c*16+i+8],OLED_DATA);
			}
			else {	
				OLED_Set_Pos(x,y);
				for(i=0;i<6;i++)
				OLED_WR_Byte(F6x8[c][i],OLED_DATA);
				
			}
}
//m^n函数
u32 oled_pow(u8 m,u8 n)
{
	u32 result=1;	 
	while(n--)result*=m;    
	return result;
}				  
//显示2个数字
//x,y :起点坐标	 
//len :数字的位数
//size:字体大小
//mode:模式	0,填充模式;1,叠加模式
//num:数值(0~4294967295);	 		  
void OLED_ShowNum(u8 x,u8 y,u32 num,u8 len,u8 size2)
{         	
	u8 t,temp;
	u8 enshow=0;						   
	for(t=0;t<len;t++)
	{
		temp=(num/oled_pow(10,len-t-1))%10;
		if(enshow==0&&t<(len-1))
		{
			if(temp==0)
			{
				OLED_ShowChar(x+(size2/2)*t,y,' ',size2);
				continue;
			}else enshow=1; 
		 	 
		}
	 	OLED_ShowChar(x+(size2/2)*t,y,temp+'0',size2); 
	}
} 
//显示一个字符号串
void OLED_ShowString(u8 x,u8 y,u8 *chr,u8 Char_Size)
{
	unsigned char j=0;
	while (chr[j]!='\0')
	{		OLED_ShowChar(x,y,chr[j],Char_Size);
			x+=8;
		if(x>120){x=0;y+=2;}
			j++;
	}
}
//显示汉字
void OLED_ShowCHinese(u8 x,u8 y,u8 no)
{      			    
	u8 t,adder=0;
	OLED_Set_Pos(x,y);	
    for(t=0;t<16;t++)
		{
				OLED_WR_Byte(Hzk[2*no][t],OLED_DATA);
				adder+=1;
     }	
		OLED_Set_Pos(x,y+1);	
    for(t=0;t<16;t++)
			{	
				OLED_WR_Byte(Hzk[2*no+1][t],OLED_DATA);
				adder+=1;
      }					
}
/***********功能描述：显示显示BMP图片128×64起始点坐标(x,y),x的范围0～127，y为页的范围0～7*****************/
void OLED_DrawBMP(unsigned char x0, unsigned char y0,unsigned char x1, unsigned char y1,unsigned char BMP[])
{ 	
 unsigned int j=0;
 unsigned char x,y;
  
  if(y1%8==0) y=y1/8;      
  else y=y1/8+1;
	for(y=y0;y<y1;y++)
	{
		OLED_Set_Pos(x0,y);
    for(x=x0;x<x1;x++)
	    {      
	    	OLED_WR_Byte(BMP[j++],OLED_DATA);	    	
	    }
	}
} 

//初始化SSD1306					    
void OLED_Init(void)
{ 	
 
 	 
 	GPIO_InitTypeDef  GPIO_InitStruct;
 	

//	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);	
	__HAL_RCC_GPIOA_CLK_ENABLE();	//使能A端口时钟
	
	GPIO_InitStruct.Pin = GPIO_PIN_5|GPIO_PIN_7;;
 	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP; 		 //推挽输出
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;;//速度50MHz
	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
 	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5|GPIO_PIN_7, GPIO_PIN_SET);


//delay_ms(800);
OLED_WR_Byte(0xAE,OLED_CMD);//--display off
	OLED_WR_Byte(0x00,OLED_CMD);//---set low column address
	OLED_WR_Byte(0x10,OLED_CMD);//---set high column address
	OLED_WR_Byte(0x40,OLED_CMD);//--set start line address  
	OLED_WR_Byte(0xB0,OLED_CMD);//--set page address
	OLED_WR_Byte(0x81,OLED_CMD); // contract control
	OLED_WR_Byte(0xFF,OLED_CMD);//--128   
	OLED_WR_Byte(0xA1,OLED_CMD);//set segment remap 
	OLED_WR_Byte(0xA6,OLED_CMD);//--normal / reverse
	OLED_WR_Byte(0xA8,OLED_CMD);//--set multiplex ratio(1 to 64)
	OLED_WR_Byte(0x3F,OLED_CMD);//--1/32 duty
	OLED_WR_Byte(0xC8,OLED_CMD);//Com scan direction
	OLED_WR_Byte(0xD3,OLED_CMD);//-set display offset
	OLED_WR_Byte(0x00,OLED_CMD);//
	
	OLED_WR_Byte(0xD5,OLED_CMD);//set osc division
	OLED_WR_Byte(0x80,OLED_CMD);//
	
	OLED_WR_Byte(0xD8,OLED_CMD);//set area color mode off
	OLED_WR_Byte(0x05,OLED_CMD);//
	
	OLED_WR_Byte(0xD9,OLED_CMD);//Set Pre-Charge Period
	OLED_WR_Byte(0xF1,OLED_CMD);//
	
	OLED_WR_Byte(0xDA,OLED_CMD);//set com pin configuartion
	OLED_WR_Byte(0x12,OLED_CMD);//
	
	OLED_WR_Byte(0xDB,OLED_CMD);//set Vcomh
	OLED_WR_Byte(0x30,OLED_CMD);//
	
	OLED_WR_Byte(0x8D,OLED_CMD);//set charge pump enable
	OLED_WR_Byte(0x14,OLED_CMD);//
	
	OLED_WR_Byte(0xAF,OLED_CMD);//--turn on oled panel
}  

void Main_interface()
{
			OLED_ShowCHinese(10,0,14);//中
		OLED_ShowCHinese(42,0,15);//景
		OLED_ShowCHinese(74,0,16);//园
		OLED_ShowCHinese(106,0,17);//电
		OLED_ShowString(0,3,"Pass Left :",16);
		OLED_ShowNum(96,3,System_Data.Lift_Num,4,16);
		OLED_ShowString(0,6,"Pass Right:",16);
		OLED_ShowNum(96,6,System_Data.Right_Num,4,16);
		if(KEY_BUF[KEY1].KEY_EVENT == KEY_UP || KEY_BUF[KEY2].KEY_EVENT == KEY_UP)
		{
			OLED_Clear();
			System_Data.Edit_Choose_Mark = Password_Mark;
		}
}

void Menu_interface()
{

	  //根据键位响应选择，箭头指示
		System_Data.Edit_Choose_Mark = Edit_WaitTime_Mark;
	  
	while(1)
	{
	
			
		switch(System_Data.Edit_Choose_Mark)
		{
			case Edit_WaitTime_Mark:
						OLED_ShowCHinese(0,0,25);
						OLED_ShowCHinese(16,0,26);
						OLED_ShowCHinese(32,0,10);
						OLED_ShowCHinese(48,0,27);
						OLED_ShowCHinese(64,0,28);

						OLED_ShowCHinese(0,3,6);
						OLED_ShowCHinese(16,3,7);
						OLED_ShowCHinese(32,3,8);
						OLED_ShowCHinese(48,3,9);
						OLED_ShowCHinese(64,3,4);
						OLED_ShowCHinese(80,3,5);
			
						OLED_ShowCHinese(0,6,0);
						OLED_ShowCHinese(16,6,1);
						OLED_ShowCHinese(32,6,2);
						OLED_ShowCHinese(48,6,3);
						OLED_ShowCHinese(64,6,4);
						OLED_ShowCHinese(80,6,5);	
						OLED_ShowString(104,3,"<<",16);	
	
					if(KEY_BUF[KEY2].KEY_EVENT == KEY_UP )
					{
						OLED_Clear();
						System_Data.Edit_Choose_Mark = Edit_RealyTime_Mark;
					}
				
				break;
			
			case Edit_RealyTime_Mark:
						OLED_ShowCHinese(0,0,25);
						OLED_ShowCHinese(16,0,26);
						OLED_ShowCHinese(32,0,10);
						OLED_ShowCHinese(48,0,27);
						OLED_ShowCHinese(64,0,28);
			
						OLED_ShowCHinese(0,3,6);
						OLED_ShowCHinese(16,3,7);
						OLED_ShowCHinese(32,3,8);
						OLED_ShowCHinese(48,3,9);
						OLED_ShowCHinese(64,3,4);
						OLED_ShowCHinese(80,3,5);
			
						OLED_ShowCHinese(0,6,0);
						OLED_ShowCHinese(16,6,1);
						OLED_ShowCHinese(32,6,2);
						OLED_ShowCHinese(48,6,3);
						OLED_ShowCHinese(64,6,4);
						OLED_ShowCHinese(80,6,5);			

						OLED_ShowString(104,6,"<<",16);	
					if(KEY_BUF[KEY1].KEY_EVENT == KEY_UP )
					{
						OLED_Clear();
						System_Data.Edit_Choose_Mark = Edit_WaitTime_Mark;
					}
				
				break;
			

			
			default:
				break;
		}
		
		if(KEY_BUF[KEY1].KEY_EVENT == KEY_LONG)
		{
				OLED_Clear();
				break;
		}
		
		if(KEY_BUF[KEY2].KEY_EVENT == KEY_LONG)
		{
			OLED_Clear();
			System_Data.Edit_Choose_Mark = Main_Mark;			
			break;
		}
		;
	}
	
	
}

void Password_interface() 
{

	static u8* PASSWORD_NUM[7]={" ","*","**","***","****","*****","******"};
	char	PASSWORD[6]={1,1,2,2,1,2},PASSWORD_INPUT[5];
	u8 i = 0;
//	OLED_ShowString(0,0,"ADMIN Password",16);
	
	
	OLED_ShowCHinese(0,0,18);
	OLED_ShowCHinese(16,0,19);
	OLED_ShowCHinese(32,0,20);
	OLED_ShowCHinese(48,0,21);
	OLED_ShowCHinese(64,0,22);
	OLED_ShowCHinese(80,0,23);
	OLED_ShowCHinese(96,0,24);
	OLED_ShowString(0,3,"INPUT: ",16);
	while(1)
	{
		if(KEY_BUF[KEY1].KEY_EVENT == KEY_UP && i <6)
		{
			
			OLED_Clear();
			OLED_ShowCHinese(0,0,18);
			OLED_ShowCHinese(16,0,19);
			OLED_ShowCHinese(32,0,20);
			OLED_ShowCHinese(48,0,21);
			OLED_ShowCHinese(64,0,22);
			OLED_ShowCHinese(80,0,23);
			OLED_ShowCHinese(96,0,24);
			OLED_ShowString(0,3,"INPUT: ",16);
			OLED_ShowString(80,3,PASSWORD_NUM[i+1],16);
			PASSWORD_INPUT[i]= 1 ;
			i++;
		}
		 if(KEY_BUF[KEY2].KEY_EVENT == KEY_UP && i<6)
		{
			
			OLED_Clear();
			OLED_ShowCHinese(0,0,18);
			OLED_ShowCHinese(16,0,19);
			OLED_ShowCHinese(32,0,20);
			OLED_ShowCHinese(48,0,21);
			OLED_ShowCHinese(64,0,22);
			OLED_ShowCHinese(80,0,23);
			OLED_ShowCHinese(96,0,24);
			OLED_ShowString(0,3,"INPUT:",16);
			OLED_ShowString(80,3,PASSWORD_NUM[i+1],16);
			PASSWORD_INPUT[i]= 2 ;
			i++;
		}
		
		if( i == 6 )
		{
			
			if(memcmp(PASSWORD, PASSWORD_INPUT,strlen(PASSWORD)) == 0 && i == 6) //密码正确
			{
				OLED_Clear();
				System_Data.Edit_Choose_Mark = Menu_Mark;
				break;
			}
			else
			{
				i = 0;
				OLED_Clear();
				System_Data.Edit_Choose_Mark = Main_Mark;
				break;
			}
		}
	}
	

	
}


void Edit_interface()
{
	

				OLED_ShowCHinese(48,6,25);
				OLED_ShowCHinese(64,6,26);
				OLED_ShowCHinese(80,6,11);
				OLED_ShowCHinese(96,6,12);
				OLED_ShowCHinese(112,6,13);
	//System_Data
	while(1)
	{	
		
	switch(System_Data.Edit_Choose_Mark )
	{
		case Edit_WaitTime_Mark:

				OLED_ShowString(0,3,"WaitTime(s):",16);
				OLED_ShowNum(104,3,System_Data.Wait_Time,2,16);
				OLED_ShowCHinese(48,6,25);
				OLED_ShowCHinese(64,6,26);
				OLED_ShowCHinese(80,6,11);
				OLED_ShowCHinese(96,6,12);
				OLED_ShowCHinese(112,6,13);
		
		if(KEY_BUF[KEY2].KEY_EVENT == KEY_UP) //-
		{
			OLED_Clear();
			if(System_Data.Wait_Time >0 )
			System_Data.Wait_Time--;
			else
				System_Data.Wait_Time = 0;
		}
			if(KEY_BUF[KEY1].KEY_EVENT == KEY_UP)//+
		{
			OLED_Clear();
			System_Data.Wait_Time++;
			if(System_Data.Wait_Time >99 )
				System_Data.Wait_Time = 99;
		}
			
		break;
		
		case Edit_RealyTime_Mark:
				
				OLED_ShowString(0,3,"RealyTime(s):",16);
				OLED_ShowNum(104,3,System_Data.Realy_Time,2,16);
				OLED_ShowCHinese(48,6,25);
				OLED_ShowCHinese(64,6,26);
				OLED_ShowCHinese(80,6,11);
				OLED_ShowCHinese(96,6,12);
				OLED_ShowCHinese(112,6,13);
		if(KEY_BUF[KEY2].KEY_EVENT == KEY_UP) //-
		{
			OLED_Clear();
			if(System_Data.Realy_Time >0 )
			System_Data.Realy_Time--;
			else
				System_Data.Realy_Time = 0;
		}
			if(KEY_BUF[KEY1].KEY_EVENT == KEY_UP)//+
		{
			OLED_Clear();
			System_Data.Realy_Time++;
			if(System_Data.Realy_Time >99 )	
			System_Data.Realy_Time = 99;	
		}	
		
		break;
		
		default:
			break;
	}
			if(KEY_BUF[KEY2].KEY_EVENT == KEY_LONG)
		{
			WriteFlash(0x01,Write_Frist_Flag_ADDR);
			WriteFlash(System_Data.Wait_Time,WaitTime_ADDR);
			WriteFlash(System_Data.Realy_Time,RealyTime_ADDR);
			System_Data.Edit_Choose_Mark = Menu_Mark;	
			OLED_Clear();			
			break;
		}
	
					if(KEY_BUF[KEY1].KEY_EVENT == KEY_LONG)
		{

			System_Data.Edit_Choose_Mark = Menu_Mark;	
			OLED_Clear();			
			break;
		}
	
	}
}

void Show_UI()
{
//	 Main_Mark,
//	 Password_Mark,
//	 Menu_Mark,
//	 Edit_Mark,
//	 Edit_WaitTime_Mark,
//	 Edit_RealyTime_Mark,
	switch(System_Data.Edit_Choose_Mark)
	{
		case Main_Mark:
			Main_interface();
			break;
		
		case Password_Mark:
			Password_interface();
			
			break;
		
		case Menu_Mark:
			Menu_interface();
			break;
		
		case Edit_WaitTime_Mark:
			Edit_interface();
			break;
		
		case Edit_RealyTime_Mark:
			Edit_interface();
			break;
		
		case Edit_Mark:
			Edit_interface();
			break;
		
		default :
			break;
	}
}


